tap "derailed/k9s"
brew "python@3.13"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "brew-cask-completion"
brew "chezmoi"
brew "coursier"
brew "curl"
brew "docker-completion"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gradle"
brew "grafana"
brew "graphviz"
brew "grc"
brew "grep"
brew "grpcurl"
brew "helm"
brew "htop"
brew "iftop"
brew "jq"
brew "k9s"
brew "kafka"
brew "kcat"
brew "kubernetes-cli"
brew "kubectx"
brew "lsd"
brew "make"
brew "maven"
brew "mise"
brew "mysql"
brew "neovim"
brew "openssh"
brew "pre-commit"
brew "prometheus"
brew "protobuf"
brew "sbt"
brew "scala"
brew "shellcheck"
brew "terraform"
brew "tree"
brew "watch"
brew "wget"
brew "zookeeper"
brew "zsh"
brew "zsh-autosuggestions"
cask "1password"
cask "1password-cli"
cask "beyond-compare"
cask "docker-desktop"
cask "firefox"
cask "intellij-idea"
cask "iterm2"
cask "libreoffice"
cask "sizeup"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
vscode "bbenoist.nix"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
